OpenDTEF-v1912/tutorials/multiphase/interFoam/RAS/weirOverflow/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh
\cp 0/alpha.water.orig 0/alpha.water

runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
